Hybrid-Memcached/ex4_result/memtier_1t_16t_default_datasize_178_cycle_50_result
16        Threads
50        Connections per thread
120       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        39844.51          ---          ---        19.61571        19.19900        32.51100        45.82300      8560.34 
Gets           36.68        36.68         0.00        19.11590        18.94300        29.18300        44.54300         8.63 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      39881.19        36.68         0.00        19.61525        19.19900        32.51100        45.82300      8568.98 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.215        0.000
SET      15.743        5.000
SET      17.023       10.000
SET      17.535       15.000
SET      17.791       20.000
SET      18.047       25.000
SET      18.303       30.000
SET      18.559       35.000
SET      18.815       40.000
SET      19.071       45.000
SET      19.199       50.000
SET      19.327       52.500
SET      19.327       55.000
SET      19.455       57.500
SET      19.583       60.000
SET      19.711       62.500
SET      19.839       65.000
SET      19.839       67.500
SET      19.967       70.000
SET      20.223       72.500
SET      20.351       75.000
SET      20.351       76.250
SET      20.479       77.500
SET      20.607       78.750
SET      20.735       80.000
SET      20.863       81.250
SET      20.991       82.500
SET      21.247       83.750
SET      21.503       85.000
SET      22.015       86.250
SET      22.527       87.500
SET      22.911       88.125
SET      23.295       88.750
SET      23.679       89.375
SET      23.935       90.000
SET      24.063       90.625
SET      24.319       91.250
SET      24.447       91.875
SET      24.703       92.500
SET      24.959       93.125
SET      25.343       93.750
SET      25.471       94.062
SET      25.727       94.375
SET      25.983       94.688
SET      26.239       95.000
SET      26.495       95.312
SET      26.751       95.625
SET      27.135       95.938
SET      27.519       96.250
SET      27.775       96.562
SET      28.287       96.875
SET      28.543       97.031
SET      28.799       97.188
SET      29.055       97.344
SET      29.311       97.500
SET      29.567       97.656
SET      29.823       97.812
SET      30.079       97.969
SET      30.335       98.125
SET      30.719       98.281
SET      31.103       98.438
SET      31.359       98.516
SET      31.487       98.594
SET      31.615       98.672
SET      31.871       98.750
SET      31.999       98.828
SET      32.255       98.906
SET      32.383       98.984
SET      32.767       99.062
SET      33.279       99.141
SET      33.535       99.219
SET      33.791       99.258
SET      34.047       99.297
SET      34.303       99.336
SET      34.815       99.375
SET      35.071       99.414
SET      35.327       99.453
SET      35.583       99.492
SET      35.839       99.531
SET      36.095       99.570
SET      36.607       99.609
SET      36.607       99.629
SET      36.863       99.648
SET      37.375       99.668
SET      37.631       99.688
SET      37.887       99.707
SET      38.143       99.727
SET      38.655       99.746
SET      39.167       99.766
SET      39.423       99.785
SET      40.191       99.805
SET      40.447       99.814
SET      40.703       99.824
SET      41.215       99.834
SET      41.471       99.844
SET      41.983       99.854
SET      42.495       99.863
SET      43.263       99.873
SET      44.031       99.883
SET      45.055       99.893
SET      45.823       99.902
SET      46.591       99.907
SET      47.103       99.912
SET      47.871       99.917
SET      48.639       99.922
SET      49.151       99.927
SET      49.919       99.932
SET      50.687       99.937
SET      51.711       99.941
SET      53.503       99.946
SET      55.295       99.951
SET      55.807       99.954
SET      56.575       99.956
SET      57.087       99.958
SET      57.855       99.961
SET      58.623       99.963
SET      59.647       99.966
SET      60.927       99.968
SET      62.207       99.971
SET      63.999       99.973
SET      66.047       99.976
SET      67.071       99.977
SET      69.119       99.978
SET      71.167       99.979
SET      81.407       99.980
SET      89.087       99.982
SET      95.231       99.983
SET      97.791       99.984
SET     100.351       99.985
SET     102.399       99.987
SET     104.447       99.988
SET     105.471       99.988
SET     107.007       99.989
SET     108.031       99.990
SET     109.567       99.990
SET     110.591       99.991
SET     112.639       99.991
SET     113.663       99.992
SET     114.687       99.993
SET     115.199       99.993
SET     116.223       99.994
SET     116.735       99.994
SET     117.247       99.995
SET     117.759       99.995
SET     117.759       99.995
SET     118.783       99.995
SET     119.807       99.996
SET     120.319       99.996
SET     121.343       99.996
SET     121.855       99.997
SET     122.367       99.997
SET     122.367       99.997
SET     123.391       99.997
SET     123.903       99.997
SET     124.927       99.998
SET     124.927       99.998
SET     125.439       99.998
SET     126.463       99.998
SET     129.535       99.998
SET     268.287       99.998
SET     358.399       99.998
SET     382.975       99.999
SET     428.031       99.999
SET     473.087       99.999
SET     536.575       99.999
SET     577.535       99.999
SET     602.111       99.999
SET     638.975       99.999
SET     671.743       99.999
SET     700.415       99.999
SET     733.183       99.999
SET     753.663       99.999
SET     770.047       99.999
SET     778.239       99.999
SET     794.623       99.999
SET     815.103       99.999
SET     831.487       99.999
SET     847.871      100.000
SET     864.255      100.000
SET     872.447      100.000
SET     892.927      100.000
SET     901.119      100.000
SET     909.311      100.000
SET     917.503      100.000
SET     925.695      100.000
SET     937.983      100.000
SET     946.175      100.000
SET     954.367      100.000
SET     962.559      100.000
SET     962.559      100.000
SET     974.847      100.000
SET     983.039      100.000
SET     983.039      100.000
SET     991.231      100.000
SET     991.231      100.000
SET    1007.615      100.000
SET    1007.615      100.000
SET    1015.807      100.000
SET    1015.807      100.000
SET    1015.807      100.000
[...]
SET    1019.903      100.000
SET    1019.903      100.000
SET    1019.903      100.000
[...]
SET    1023.999      100.000
SET    1023.999      100.000
SET    1023.999      100.000
[...]
SET    1036.287      100.000
SET    1036.287      100.000
SET    1036.287      100.000
[...]
SET    1048.575      100.000
SET    1048.575      100.000
---
GET       2.639        0.000
GET      16.895        5.000
GET      17.535       10.000
GET      17.791       15.000
GET      17.919       20.000
GET      18.047       25.000
GET      18.303       30.000
GET      18.431       35.000
GET      18.687       40.000
GET      18.815       45.000
GET      18.943       50.000
GET      19.071       52.500
GET      19.071       55.000
GET      19.199       57.500
GET      19.199       60.000
GET      19.327       62.500
GET      19.327       65.000
GET      19.455       67.500
GET      19.583       70.000
GET      19.583       72.500
GET      19.839       75.000
GET      19.839       76.250
GET      19.839       77.500
GET      19.967       78.750
GET      19.967       80.000
GET      20.095       81.250
GET      20.095       82.500
GET      20.223       83.750
GET      20.351       85.000
GET      20.351       86.250
GET      20.479       87.500
GET      20.607       88.125
GET      20.607       88.750
GET      20.607       89.375
GET      20.735       90.000
GET      20.735       90.625
GET      20.863       91.250
GET      20.991       91.875
GET      21.247       92.500
GET      21.503       93.125
GET      21.759       93.750
GET      21.887       94.062
GET      21.887       94.375
GET      22.143       94.688
GET      22.527       95.000
GET      22.783       95.312
GET      23.039       95.625
GET      23.679       95.938
GET      24.063       96.250
GET      24.319       96.562
GET      24.831       96.875
GET      25.087       97.031
GET      25.599       97.188
GET      25.855       97.344
GET      25.983       97.500
GET      26.239       97.656
GET      26.623       97.812
GET      27.007       97.969
GET      27.135       98.125
GET      27.391       98.281
GET      27.647       98.438
GET      27.775       98.516
GET      27.903       98.594
GET      28.159       98.672
GET      28.543       98.750
GET      28.671       98.828
GET      28.927       98.906
GET      29.183       98.984
GET      29.439       99.062
GET      29.567       99.141
GET      30.079       99.219
GET      30.079       99.258
GET      30.719       99.297
GET      31.359       99.336
GET      31.359       99.375
GET      31.487       99.414
GET      31.615       99.453
GET      31.999       99.492
GET      32.255       99.531
GET      33.023       99.570
GET      33.279       99.609
GET      33.535       99.629
GET      34.047       99.648
GET      34.303       99.668
GET      35.071       99.688
GET      35.583       99.707
GET      35.583       99.727
GET      35.839       99.746
GET      36.351       99.766
GET      36.351       99.785
GET      36.607       99.805
GET      36.607       99.814
GET      37.119       99.824
GET      37.119       99.834
GET      39.679       99.844
GET      39.679       99.854
GET      39.679       99.863
GET      40.703       99.873
GET      40.703       99.883
GET      44.543       99.893
GET      44.543       99.902
GET      44.543       99.907
GET      45.823       99.912
GET      45.823       99.917
GET      45.823       99.922
GET      45.823       99.927
GET      45.823       99.932
GET      99.327       99.937
GET      99.327       99.941
GET      99.327       99.946
GET      99.327       99.951
GET      99.327       99.954
GET     105.471       99.956
GET     105.471       99.958
GET     105.471       99.961
GET     105.471       99.963
GET     105.471       99.966
GET     105.471       99.968
GET     105.471       99.971
GET     105.471       99.973
GET     105.471       99.976
GET     105.471       99.977
GET     107.007       99.978
GET     107.007      100.000
---
WAIT      0.000      100.000